Revit 2026 API

# IFCImportOptionsLinkPosition Property

---

The position of the Linked IFC File in the Host Document.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCLinkPosition LinkPosition { get; set; }
```
```vb
Public Property LinkPosition As IFCLinkPosition
	Get
	Set
```
```cpp
public:
property IFCLinkPosition LinkPosition {
	IFCLinkPosition get ();
	void set (IFCLinkPosition value);
}
```
```fsharp
member LinkPosition : IFCLinkPosition with get, set
```

#### Property Value

IFCLinkPosition

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

IFCImportOptions Class

Autodesk.Revit.DB.IFC Namespace